infrastructure/jmeter/router-manager-service.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="router-manager-service plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="SendCommand Load">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="SendCommand">
          <stringProp name="GRPCSampler.protoFolder">/Users/andrey/DEVELOP/!lesson/ourcode-iot-platform/router-manager-service/protobuf</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8890</stringProp>
          <stringProp name="GRPCSampler.fullMethod">router_manager.RouterManagerService/SendCommand</stringProp>
          <stringProp name="GRPCSampler.deadline">5000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">${requestBody}</stringProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">5000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.UUID
import groovy.json.JsonOutput
import java.util.concurrent.ConcurrentHashMap
import java.util.concurrent.ConcurrentLinkedQueue

// 8354d1bd-ea67-494f-90fc-4b88bd874e95 router
// 9354d1bd-ea67-494f-90fc-4b88bd874e95 command

int MAX_ROUTERS = 1000
int MAX_QUEUE_SIZE = 100  // максимальное количество команд на роутер

if (!(props.get(&quot;router_commands&quot;) instanceof ConcurrentHashMap)) {
    props.put(&quot;router_commands&quot;, new ConcurrentHashMap())
}
if (props.get(&quot;router_counter&quot;) == null) {
    props.put(&quot;router_counter&quot;, 0)
}

def routerCommands = props.get(&quot;router_commands&quot;) as ConcurrentHashMap
int routerCounter = props.get(&quot;router_counter&quot;) as Integer

def body = [commandType: &quot;TEST_LOAD&quot;]
String commandId = UUID.randomUUID().toString()

if (Math.random() &lt; 0.7) {
    // 70% - команда для конкретного роутера
    String routerUuid
    
    if (!routerCommands.isEmpty() &amp;&amp; Math.random() &lt; 0.8) {
        def existingUuids = routerCommands.keySet().toArray()
        routerUuid = existingUuids[(Math.random() * existingUuids.size()) as int] as String
    } else if (routerCounter &lt; MAX_ROUTERS) {
        routerUuid = UUID.randomUUID().toString()
        routerCounter++
        props.put(&quot;router_counter&quot;, routerCounter)
        routerCommands[routerUuid] = new ConcurrentLinkedQueue()
    } else {
        def existingUuids = routerCommands.keySet().toArray()
        routerUuid = existingUuids[(Math.random() * existingUuids.size()) as int] as String
    }
    
    def queue = routerCommands[routerUuid] as ConcurrentLinkedQueue
    queue.add(commandId)
    // Ограничиваем очередь до 100 команд
    while (queue.size() &gt; MAX_QUEUE_SIZE) {
        queue.poll()
    }

    body.routerSerial = routerUuid
} else {
    // 30% - broadcast на все роутеры
    routerCommands.each { routerUuid, queue -&gt;
        queue.add(commandId)
        while (queue.size() &gt; MAX_QUEUE_SIZE) {
            queue.poll()
        }
    }
}

vars.put(&quot;requestBody&quot;, JsonOutput.toJson(body))</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PollCommands Load">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="PollCommands">
          <stringProp name="GRPCSampler.protoFolder">/Users/andrey/DEVELOP/!lesson/ourcode-iot-platform/router-manager-service/protobuf</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8890</stringProp>
          <stringProp name="GRPCSampler.fullMethod">router_manager.RouterManagerService/PollCommands</stringProp>
          <stringProp name="GRPCSampler.deadline">5000</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;router_serial&quot;: &quot;${random_router_serial}&quot;}</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">5000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.concurrent.ConcurrentHashMap

if (!(props.get(&quot;router_commands&quot;) instanceof ConcurrentHashMap)) {
    props.put(&quot;router_commands&quot;, new ConcurrentHashMap())
}

def routerCommands = props.get(&quot;router_commands&quot;) as ConcurrentHashMap

String selectedRouterUuid = null

if (!routerCommands.isEmpty()) {
    def routerUuids = routerCommands.keySet().toArray()
    selectedRouterUuid = routerUuids[(Math.random() * routerUuids.size()) as int] as String
//    log.info(&quot;PollCommands: выбран router_serial=${selectedRouterUuid}&quot;)
} else {
    selectedRouterUuid = &quot;8354d1bd-ea67-494f-90fc-4b88bd874e95&quot;
//    log.warn(&quot;PollCommands: нет роутеров, использую fallback&quot;)
}

vars.put(&quot;random_router_serial&quot;, selectedRouterUuid)</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import groovy.json.JsonSlurper
import java.util.concurrent.ConcurrentHashMap

if (!(props.get(&quot;acknowledged_commands&quot;) instanceof ConcurrentHashMap)) {
    props.put(&quot;acknowledged_commands&quot;, new ConcurrentHashMap())
}
def ackCommands = props.get(&quot;acknowledged_commands&quot;) as ConcurrentHashMap

def response = prev.getResponseDataAsString()
if (!response?.trim()?.startsWith(&apos;{&apos;)) {
    log.warn(&quot;PollCommands: некорректный формат ответа&quot;)
    return
}

try {
    def json = new JsonSlurper().parseText(response)
    def requestedRouter = vars.get(&quot;random_router_serial&quot;)
    
    def commandCount = json.commands?.size() ?: 0
    log.info(&quot;PollCommands: для роутера ${requestedRouter} получено ${commandCount} команд&quot;)
    
    json.commands?.eachWithIndex { cmd, index -&gt;
        if (cmd?.router_serial &amp;&amp; cmd?.id) {
            def commandKey = &quot;${cmd.router_serial}:${cmd.id}&quot;
            ackCommands[commandKey] = true
            log.info(&quot;PollCommands: команда ${index+1}: ${commandKey} (добавлена для подтверждения)&quot;)
        }
    }
    
} catch (Exception e) {
    log.error(&quot;PollCommands: ошибка обработки ответа&quot;, e)
}</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="AckCommands Load">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="AckCommands">
          <stringProp name="GRPCSampler.protoFolder">/Users/andrey/DEVELOP/!lesson/ourcode-iot-platform/router-manager-service/protobuf</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8890</stringProp>
          <stringProp name="GRPCSampler.fullMethod">router_manager.RouterManagerService/AckCommand</stringProp>
          <stringProp name="GRPCSampler.deadline">5000</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
  &quot;router_serial&quot;: &quot;${random_router_serial}&quot;,
  &quot;command_id&quot;: &quot;${command_id}&quot;
}</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">5000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.concurrent.ConcurrentHashMap

if (!(props.get(&quot;acknowledged_commands&quot;) instanceof ConcurrentHashMap)) {
    props.put(&quot;acknowledged_commands&quot;, new ConcurrentHashMap())
}
def ackCommands = props.get(&quot;acknowledged_commands&quot;) as ConcurrentHashMap

String routerUuid = null
String commandId = null

def commandToAck = ackCommands.find { commandKey, needsAck -&gt; 
    needsAck == true
}

if (commandToAck) {
    def commandKey = commandToAck.key as String
    def parts = commandKey.split(&quot;:&quot;)
    routerUuid = parts[0]
    commandId = parts[1]
    
    ackCommands[commandKey] = &quot;in_progress&quot;
    
    log.info(&quot;AckCommands: готовлю подтверждение для ${commandKey}&quot;)
} else {
    routerUuid = &quot;8354d1bd-ea67-494f-90fc-4b88bd874e95&quot;
    commandId = &quot;9354d1bd-ea67-494f-90fc-4b88bd874e95&quot;
//    log.warn(&quot;AckCommands: нет команд для подтверждения в acknowledged_commands&quot;)
}

vars.put(&quot;random_router_serial&quot;, routerUuid)
vars.put(&quot;command_id&quot;, commandId)
vars.put(&quot;ack_command_key&quot;, &quot;${routerUuid}:${commandId}&quot;)</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.concurrent.ConcurrentHashMap

if (prev.isSuccessful()) {
    def commandKey = vars.get(&quot;ack_command_key&quot;)
    
    if (commandKey &amp;&amp; commandKey != &quot;8354d1bd-ea67-494f-90fc-4b88bd874e95:9354d1bd-ea67-494f-90fc-4b88bd874e95&quot;) {
        if (!(props.get(&quot;acknowledged_commands&quot;) instanceof ConcurrentHashMap)) {
            props.put(&quot;acknowledged_commands&quot;, new ConcurrentHashMap())
        }
        
        def ackCommands = props.get(&quot;acknowledged_commands&quot;) as ConcurrentHashMap
        
        // Удаляем подтвержденную команду
        ackCommands.remove(commandKey)
//        log.info(&quot;AckCommands: команда ${commandKey} успешно подтверждена и удалена&quot;)
    } else {
//        log.info(&quot;AckCommands: подтверждена fallback команда, ничего не удаляю&quot;)
    }
} else {
    log.warn(&quot;AckCommands: запрос не удался, команда остается в очереди на подтверждение&quot;)
    def commandKey = vars.get(&quot;ack_command_key&quot;)
    if (commandKey) {
        def ackCommands = props.get(&quot;acknowledged_commands&quot;) as ConcurrentHashMap
        ackCommands[commandKey] = true
    }
}

vars.remove(&quot;ack_command_key&quot;)</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="tearDown Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">props.remove(&quot;router_commands&quot;)
props.remove(&quot;router_counter&quot;)
props.remove(&quot;acknowledged_commands&quot;)
log.info(&quot;Все коллекции и счетчики удалены в финальном шаге&quot;)</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>